db = [
    {'id': '1', 'question': '發生車禍後，應該立即採取哪些步驟？', 'answer': '確保安全，報警，交換資訊，獲取目擊證人信息。相關法條：《民法》184條，有關賠償的規定。'},
    {'id': '2', 'question': '在家庭暴力情況下，我該如何保護自己？', 'answer': '尋求安全，聯繫當地警察或家暴協助熱線，申請法院保護令。相關法條：《刑法》286-2條，涉及家庭暴力罪。'},
    {'id': '3', 'question': '離婚後，子女的監護權如何決定？', 'answer': '法院考慮子女最佳利益，監護權授予最適合提供良好環境的父母。相關法條：《民法》1059條，有關監護權的規定。'},
    {'id': '4', 'question': '發現公司違法行為，我該如何舉報？', 'answer': '可以匿名舉報給當地稽查機關，也可以聘請律師提起公益訴訟。相關法條：《刑法》234條，有關刑責的規定。'},
    {'id': '5', 'question': '租賃合同終止後，租客應該支付哪些費用？', 'answer': '租客應支付應付的租金和可能的損害賠償。相關法條：《民法》537條，有關租賃合同的規定。'},
    {'id': '6', 'question': '被解雇後有哪些勞動權益保護？', 'answer': '被解雇的員工有權獲得相應的賠償，享有再就業援助。相關法條：《勞動基準法》16條，有關勞動權益的規定。'},
    {'id': '7', 'question': '遺囑如何撰寫以確保合法有效？', 'answer': '遺囑應由成年人親筆簽名，並有足夠的證人。相關法條：《民法》1048條，有關遺囑的規定。'},
    {'id': '8', 'question': '發現鄰居違法建築，應該如何處理？', 'answer': '可以向當地城市規劃或建築管理機構舉報，由相關部門進行調查。相關法條：《都市計劃法》31條，有關城市建設的規定。'},
    {'id': '9', 'question': '在線消費時，如何保護個人隱私？', 'answer': '消費者有權要求商家保護個人隱私，商家應提供隱私政策。相關法條：《個人資料保護法》。'},
    {'id': '10', 'question': '發現商家售賣偽劣商品，應該如何投訴？', 'answer': '可以向當地工商行政管理機構投訴，也可以聘請律師提起侵權訴訟。相關法條：《反不正當競爭法》。'},
]